tests/reports/_res/autocannon-single.txt
tests  (git)-[main]- ➤ npx autocannon -c 50 -d 30 "http://localhost:3000/articles"
Running 30s test @ http://localhost:3000/articles
50 connections


┌─────────┬───────┬───────┬───────┬───────┬─────────┬─────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg     │ Stdev   │ Max    │
├─────────┼───────┼───────┼───────┼───────┼─────────┼─────────┼────────┤
│ Latency │ 10 ms │ 15 ms │ 26 ms │ 35 ms │ 16.2 ms │ 5.69 ms │ 146 ms │
└─────────┴───────┴───────┴───────┴───────┴─────────┴─────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬───────┬──────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5% │ Avg      │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼───────┼──────────┼─────────┼─────────┤
│ Req/Sec   │ 2,247   │ 2,247   │ 3,065   │ 3,329 │ 2,994.94 │ 283.79  │ 2,247   │
├───────────┼─────────┼─────────┼─────────┼───────┼──────────┼─────────┼─────────┤
│ Bytes/Sec │ 20.3 MB │ 20.3 MB │ 27.6 MB │ 30 MB │ 27 MB    │ 2.56 MB │ 20.3 MB │
└───────────┴─────────┴─────────┴─────────┴───────┴──────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

90k requests in 30.02s, 810 MB read
tests  (git)-[main]- ➤ npx autocannon -c 100 -d 30 "http://localhost:3000/articles"
Running 30s test @ http://localhost:3000/articles
100 connections


┌─────────┬───────┬───────┬───────┬───────┬──────────┬─────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev   │ Max    │
├─────────┼───────┼───────┼───────┼───────┼──────────┼─────────┼────────┤
│ Latency │ 22 ms │ 33 ms │ 49 ms │ 54 ms │ 33.19 ms │ 7.34 ms │ 147 ms │
└─────────┴───────┴───────┴───────┴───────┴──────────┴─────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼─────────┼─────────┤
│ Req/Sec   │ 2,607   │ 2,607   │ 3,015   │ 3,177   │ 2,967.94 │ 164.75  │ 2,606   │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼─────────┼─────────┤
│ Bytes/Sec │ 23.5 MB │ 23.5 MB │ 27.2 MB │ 28.7 MB │ 26.8 MB  │ 1.49 MB │ 23.5 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

89k requests in 30.02s, 803 MB read