tests/reports/_res/bench.txt
tests  (git)-[main]- ➤ npx autocannon -c 50 -d 30 "http://localhost:3000/articles"
Running 30s test @ http://localhost:3000/articles
50 connections


┌─────────┬───────┬───────┬───────┬───────┬──────────┬─────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev   │ Max    │
├─────────┼───────┼───────┼───────┼───────┼──────────┼─────────┼────────┤
│ Latency │ 10 ms │ 16 ms │ 26 ms │ 32 ms │ 16.53 ms │ 5.94 ms │ 157 ms │
└─────────┴───────┴───────┴───────┴───────┴──────────┴─────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Req/Sec   │ 1,571   │ 1,571   │ 3,043   │ 3,199   │ 2,936.94 │ 354.48 │ 1,571   │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Bytes/Sec │ 14.2 MB │ 14.2 MB │ 27.4 MB │ 28.9 MB │ 26.5 MB  │ 3.2 MB │ 14.2 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

88k requests in 30.02s, 794 MB read