tests/reports/_res/benchtest-json.txt
single:
===========
tests  (git)-[main]- ➤ npx autocannon -c 50 -d 30 "http://localhost:3000/"
Running 30s test @ http://localhost:3000/
50 connections


┌─────────┬──────┬──────┬───────┬───────┬─────────┬─────────┬───────┐
│ Stat    │ 2.5% │ 50%  │ 97.5% │ 99%   │ Avg     │ Stdev   │ Max   │
├─────────┼──────┼──────┼───────┼───────┼─────────┼─────────┼───────┤
│ Latency │ 5 ms │ 5 ms │ 9 ms  │ 11 ms │ 5.56 ms │ 1.29 ms │ 55 ms │
└─────────┴──────┴──────┴───────┴───────┴─────────┴─────────┴───────┘
┌───────────┬────────┬────────┬─────────┬────────┬─────────┬────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%  │ Avg     │ Stdev  │ Min    │
├───────────┼────────┼────────┼─────────┼────────┼─────────┼────────┼────────┤
│ Req/Sec   │ 6,731  │ 6,731  │ 8,335   │ 8,439  │ 8,262.4 │ 297.67 │ 6,731  │
├───────────┼────────┼────────┼─────────┼────────┼─────────┼────────┼────────┤
│ Bytes/Sec │ 6.7 MB │ 6.7 MB │ 8.29 MB │ 8.4 MB │ 8.22 MB │ 295 kB │ 6.7 MB │
└───────────┴────────┴────────┴─────────┴────────┴─────────┴────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

248k requests in 30.01s, 247 MB read



cluster:
===========
tests  (git)-[main]- ➤ npx autocannon -c 50 -d 30 "http://localhost:3000/"
Running 30s test @ http://localhost:3000/
50 connections


┌─────────┬──────┬──────┬───────┬──────┬─────────┬─────────┬───────┐
│ Stat    │ 2.5% │ 50%  │ 97.5% │ 99%  │ Avg     │ Stdev   │ Max   │
├─────────┼──────┼──────┼───────┼──────┼─────────┼─────────┼───────┤
│ Latency │ 0 ms │ 2 ms │ 6 ms  │ 9 ms │ 1.91 ms │ 2.01 ms │ 87 ms │
└─────────┴──────┴──────┴───────┴──────┴─────────┴─────────┴───────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬───────────┬──────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg       │ Stdev    │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼───────────┼──────────┼─────────┤
│ Req/Sec   │ 14,735  │ 14,735  │ 21,023  │ 23,055  │ 20,583.07 │ 1,873.12 │ 14,734  │
├───────────┼─────────┼─────────┼─────────┼─────────┼───────────┼──────────┼─────────┤
│ Bytes/Sec │ 14.9 MB │ 14.9 MB │ 21.2 MB │ 23.3 MB │ 20.8 MB   │ 1.89 MB  │ 14.9 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴───────────┴──────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

617k requests in 30.03s, 624 MB read